<a href="https://colab.research.google.com/github/Graciliana/ExercicioDosEstudos-Python_Colab/blob/master/Projeto_Titanic.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# O que podemos apreder com o Titanic ainda hoje - Data Science Project
<p>Graciliana Kascher</p>
<p>31 de julho de 2020.</p>
Qual classe do navio teve mais chance de sobrevivência? Os empregados sobreviveram? As Mulheres e crianças todas sobreviveram? Será que a posição no navio determinou a morte ou a vida dos pessoas? Vamos tentar responder estas perguntas utilizando dados reais.
<br>
O <b>RMS Titanic</b> foi um navio de passageiro britânico que começou sua construção em março de 1909 e foi lançado ao mar em maio de 1911. O Titanic foi pensado para ser o navio mais luxuoso e mais seguro de sua época, gerando a lenda que nem Deus o afundaria.
A embarcação partiu em sua primeira e única viagem inaugural de Southampton para Nova Iorque em 10 de abril de 1912, realizou paradas em Cherbourg-Octeville na França e por Queenstow na Irlanda. Sendo que no dia 14 de abril às 23 horas e 40 minutos ele se colidiu com um iceberg afundando na madrugada do dia seguite com mais  de 1500 pessoas a bordo, um dos maiores desastres marítimos da história.  

Seu naufráfio destacou vários pontos fracos de seu projeto, deficiencias nos procedimentos de evacuação de emerg~encia e falhas nas regulamentações marítimas da época. Comissão de inquerito foram instauradas nos Estados Unidos e no Reino Unido, provocando mudanças nas leis internacionais de navegação que permanecem em vigor a mais de um século depois.

# Apresentação dos Dados 

Esse estudo estará utilizando dados coletados do site https://www.kaggle.com/c/titanic. Com base nas informações dispostas nesse dataset, realizarei Insigjhts acerca dos tripulantes e das circusntancias que envolveram a tragédia. Vale lembrar que tal conjunto de dados não abriga informação de todos os passageiros, mas sim de apenas 891.

OUtro proposto é realizar um aplicativo em que se coloca alguns dados como idade, Genero e classe social e ele te informaria qual  seria a probabilidade da pessoa sobreviver o naufrafio do titanic.

## Perguntas a serem respondidas:


*   Qauntas pessoas sobreviveram ao desastre, segundo este dataset?
*   A classe social que teve mais sobreviventes?
*   Qual foi porporção de Mulheres e homens que sobreviveram a tragedia?
*   Todas as meninas da primeira classe sobreviveram?

###Conhecendo a base Dados Montar Drive para para trabalhar no google Drive

In [1]:
from google.colab import drive
drive.mount('/content/drive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at /content/drive

###Importando as bibliotecas básicas

In [2]:
#Algebra Linear
import numpy as np


#Processamento/ manipulação dos dados
import pandas as pd

# Visualização dos dados 
import seaborn as sns
%matplotlib inline
import matplotlib.pyplot as plt


#seleção de valores aleatórios par plotagem
import random

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

# Obtendo os dados para analise

In [4]:
#importando os dados para analise
titanic = pd.read_csv('/content/drive/My Drive/Titanic/titanic_data.csv')
print('Este dataset possui %s linhas e %s colunas ' % (titanic.shape[0], titanic.shape[1]))
titanic.head()

Este dataset possui 891 linhas e 12 colunas

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

## Exploração/ Análise de Dados

In [5]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB